{
    "intents": [
        {
            "tag": "courses_offered",
            "patterns": [
                "What courses are offered at PLM?",
                "What programs does PLM have?",
                "Can you tell me about PLM's academic programs?",
                "What undergraduate and graduate courses are available at PLM?",
                "what are the courses in plm?"
            ],
            "responses": [
                "PLM offers a variety of undergraduate and graduate programs, including courses in Business Administration, Education, Engineering, Law, Medicine, Nursing, Social Sciences, and more."
            ]
        },
        {
            "tag": "public_or_private",
            "patterns": [
                "Is PLM a public or private university?",
                "Who owns and operates PLM?",
                "Is PLM a state university?",
                "Is PLM a government-owned university?",
                "Is PLM a public school?"
            ],
            "responses": [
                "PLM is a public university owned and operated by the City Government of Manila."
            ]
        },
        {
            "tag": "admission_process",
            "patterns": [
                "What is the admission process at PLM?",
                "How can I get admitted to PLM?",
                "What are the requirements for admission to PLM?",
                "how can i apply to plm?",
                "how to apply?"
            ],
            "responses": [
                "To be admitted to PLM, you must meet the university's admission requirements, which include passing the PLMAT (Pamantasan ng Lungsod ng Maynila Admission Test) and submitting all necessary documents."
            ]
        },
        {
            "tag": "tuition_fee",
            "patterns": [
                "What is the tuition fee at PLM?",
                "How much does it cost to study at PLM?",
                "What is the cost of attendance at PLM?",
                "What is the tuition fee for undergraduate programs at PLM?",
                "is there a tuition fee?"
            ],
            "responses": [
                "The tuition fee at PLM varies depending on the program and the student's residency status (Manila residents receive a lower rate). For the academic year 2021-2022, the tuition fee for undergraduate programs ranged from around Php 12,000 to Php 35,000 per semester."
            ]
        },
        {
            "tag": "history",
            "patterns": [
                "What is the history of PLM?",
                "When was PLM established?",
                "What is the background of PLM?",
                "Can you give me some information about PLM's history?",
                "tell me about plm's history"
            ],
            "responses": [
                "PLM was established in 1965 as a college under the administration of the City of Manila. It became a university in 2001 and is now considered one of the leading universities in the Philippines."
            ]
        },
        {
            "tag": "campus",
            "patterns": [
                "What is the campus like at PLM?",
                "Where is PLM located?",
                "Can you describe the campus of PLM?",
                "What facilities does PLM's campus have?",
                "where can i find plm?",
                "i want to find where is plm. can you tell me?"
            ],
            "responses": [
                "PLM's main campus is located in the heart of Manila, near several major landmarks and attractions. The campus is well-maintained and features modern facilities, including lecture halls, laboratories, libraries, and sports facilities."
            ]
        }
    ]
}